'''
LABERINTO EN EL QUE SE ENCUENTRA LA RANA ALEF
A: posición de Alef  
E: salida del laberinto  
#: pared  
x: bomba  
o: túnel 1  
O: túnel 2  
'''

laberinto_inicial = [
    ['#','#','#','#','#','#','#','#','#','#'],
    ['#',' ',' ','o',' ','O','#',' ',' ','E'],
    ['#','A',' ',' ','#','#',' ',' ',' ','#'],
    ['#',' ',' ','#','#','O',' ',' ','#','#'],
    ['#',' ',' ','x','#',' ',' ','x','x','#'],
    ['#','o',' ',' ','#',' ',' ',' ',' ','E'],
    ['#','#','#','#','#','#','#','#','#','#']
]
